app/Controllers/Auth.php

    public function register()
    {
        $data = [];
        helper(['form']);

        if($this->request->getMethod() == 'post') {
            $rules = [
                'first_name' => 'required|min_length[2]|max_length[50]',
                'last_name' => 'required|min_length[2]|max_length[50]',
                'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[4]|max_length[50]',
                'confirmPassword' => 'matches[password]'
            ];
            if(! $this->validate($rules)) {
                $data['validation'] = $this->validator;
            }
            else {
                $model = new UserModel();

                $newData = [
                    'first_name' => $this->request->getVar('first_name'),
                    'last_name' => $this->request->getVar('last_name'),
                    'email' => $this->request->getVar('email'),
                    'password' => $this->request->getVar('password'),
                ];
                $model->save($newData);
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`) VALUES ('Someone', 'else', 'egonza100@calstatela.edu', '$2y$10$UWxznNZDh9oGtyvym4HQcOTgFMHMUfJOeAUe.ANnAPkGClB85OWSG')