app/Models/AudioModel.php

INSERT INTO `audio` (`name`, `type`, `path`, `caption`, `updated_at`, `duration`) VALUES ('ROG Phone 7 Series Launch .webm', 'video/webm', 'C:\\xampp\\htdocs\\phpapp\\public/audio/ROG Phone 7 Series Launch .webm', 'ROG Phone 7 Series Launch .webm', '2023-04-14 20:14:50', '01:02:10')
---
    public function saveAudio($audio) {
        $this->save($audio);

SELECT *
FROM `audio`
ORDER BY `uploaded_at` DESC
 LIMIT 10
---
    public function getLastTenUpdated() {
        $builder = $this->db->table($this->table)->orderBy('uploaded_at','DESC')->limit(10);
        $query = $builder->get();

SELECT *
FROM `audio`
ORDER BY `name` ASC
---
    public function getAllByName() {
        $builder = $this->db->table($this->table)->orderBy('name', 'ASC');
        $query = $builder->get();

DELETE FROM `audio`
WHERE `id` IN ('172')
---
    public function deleteAudio($id) {
        $this->delete($id);

SELECT *
FROM `audio`
WHERE `id` = '172'
 LIMIT 1
---
    public function getAudioPath($id) {
        parent::__construct();

        $audio = $this->where('id', $id)->first();