app/Models/ImageModel.php

INSERT INTO `images` (`name`, `type`, `path`, `caption`, `updated_at`) VALUES ('58g8gv3r23zg29kw.jpg', 'image/jpeg', 'C:\\xampp\\htdocs\\pounce\\public/images/58g8gv3r23zg29kw.jpg', '58g8gv3r23zg29kw.jpg', '2023-05-02 23:08:44')
UPDATE `images` SET `id` = '91', `name` = 'sponge', `updated_at` = '2023-04-02 12:21:13'
WHERE `images`.`id` IN ('91')
---
    public function saveImage($image) {
        $this->save($image);

SELECT *
FROM `images`
ORDER BY `uploaded_at` DESC
 LIMIT 10
---
    public function getLastTenUpdated() {
        $builder = $this->db->table($this->table)->orderBy('uploaded_at','DESC')->limit(10);
        $query = $builder->get();

SELECT *
FROM `images`
ORDER BY `name` ASC
---
    public function getAllByName() {
        $builder = $this->db->table($this->table)->orderBy('name', 'ASC');
        $query = $builder->get();

DELETE FROM `images`
WHERE `id` IN ('195')
---
    public function deleteImage($id) {
        $this->delete($id);

SELECT *
FROM `images`
WHERE `id` = '195'
 LIMIT 1
---
    public function getImagePath($id) {
        // Does not work without the parent construct call
        // If you add this to the contructor, it breaks the upload.
        parent::__construct();

        $image = $this->where('id', $id)->first();