app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'eg2895@gmail.com'
 LIMIT 1
---
    public function getUser($email) {
        return $this->where('email', $email)->first();