app/Models/VideoModel.php

    public function getLastTenUpdated() {
        $builder = $this->db->table($this->table)->orderBy('uploaded_at','DESC')->limit(10);
        $query = $builder->get();
---
SELECT *
FROM `video`
ORDER BY `uploaded_at` DESC
 LIMIT 10

    public function getAllByName() {
        $builder = $this->db->table($this->table)->orderBy('name', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `video`
ORDER BY `name` ASC